[
    {
        "name": "A Note To You",
        "word1": "React",
        "word2": "MongoDb",
        "word3": "JQuery",
        "image": "envelope",
        "alt": "Pile of opened and unopened envelopes",
        "tagline": "MERN stack project",
        "repo": "https://github.com/johnathanmann/a-note-to-you",
        "deployment": "https://a-note-to-you.herokuapp.com/",
        "desc": "A Note to You is a project I did for the sake of sending my friends cute notes with a fun animation. This was a solo project that I did to practice my REST skills. My biggest challenge with this site was creating shared links for the notes. Originally I wanted to use the database id of the notes, but that didn't work since I couldn't get the id before it would be posted. So to solve this I instead used the uniqid npm to create an additional id that could be created before the post was made to the database making it possible to share the link with the user. My favorite part of this project was getting the live note display function working."
    },
    {
        "name": "Seared",
        "word1": "MYSQL",
        "word2": "Handlebars.js",
        "word3": "Bootstrap 4",
        "image": "barbecue",
        "tagline": "Bootcamp group project",
        "repo": "https://github.com/johnathanmann/Seared",
        "deployment": "https://seared-project-2.herokuapp.com/",
        "desc":"Seared was a super fun project I did with some great developers in my coding bootcamp. The goal of the project was to make a full stack website that solved a real world problem. Our problem was the age old question of “What's for dinner?”. I did all of the designing on this project which I think turned out great. One of our biggest challenges were merge conflicts with the recipes.JSON file. The problem being is we each had a different version of the file when we tried to push it. We solved this by being more conscious of what we were pushing and when we were pulling."
    },
    {
        "name": "Sprite Planner",
        "word1": "React",
        "word2": "MongoDb",
        "word3": "Express",
        "image": "planner",
        "tagline": "MERN Stack Project",
        "repo": "https://github.com/johnathanmann/sprite-planner",
        "deployment": "https://sprite-planner.herokuapp.com/"
    },
    {
        "name": "In-coded",
        "word1": "React",
        "word2": "MongoDb",
        "word3": "JWT Tokens",
        "image": "computer",
        "tagline": "MERN stack Bootcamp group project",
        "repo": "https://github.com/GavPO/in-ployed",
        "deployment": "https://in-ployed.herokuapp.com/"
    }
]